/*==============================================================================

	Title		: VERTEX_SHADER
	Description :
	Date		:
	Author		:

--------------------------------------------------------------------------------

==============================================================================*/



#pragma once
#ifndef _DX11_VERTEX_SHADER_H_
#define _DX11_VERTEX_SHADER_H_


/*------------------------------------------------------------------------------
* include宣言
------------------------------------------------------------------------------*/
#include <d3d11.h>
#include "dx_shader.h"

/*------------------------------------------------------------------------------
* define宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* extern宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* prototype宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* class宣言
------------------------------------------------------------------------------*/
namespace DX {
	namespace DX11 {
		namespace CORE {
			class VERTEX_SHADER : public Shader<ID3D11VertexShader, ID3D11Device> {
			public:

				/// <summary>
				/// コンパイルしたシェーダ作成
				/// </summary>
				/// <param name="device"></param>
				/// <returns></returns>
				HRESULT Create(ID3D11Device *device) override;

				/// <summary>
				/// コンパイル
				/// </summary>
				/// <param name="path">パス</param>
				/// <param name="entry">エントリーポイント</param>
				/// <param name="version">バージョン</param>
				/// <returns></returns>
				HRESULT Compile(LPCWSTR path, const char *entry, SHADER_VERSION version);
			};
		}
	}
}

#endif
