/*==============================================================================

	Title		: RASTERIZER
	Description :
	Date		:
	Author		:

--------------------------------------------------------------------------------

==============================================================================*/



#pragma once
#ifndef _DX11_RASTERIZER_H_
#define _DX11_RASTERIZER_H_


/*------------------------------------------------------------------------------
* include宣言
------------------------------------------------------------------------------*/
#include <d3d11.h>
#include "dx_dxparts.h"

/*------------------------------------------------------------------------------
* define宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* extern宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* prototype宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* class宣言
------------------------------------------------------------------------------*/
namespace DX {
	namespace DX11 {
		namespace CORE {
			class RASTERIZER : public DX::CORE::DX_PARTS<ID3D11RasterizerState, D3D11_RASTERIZER_DESC, ID3D11Device> {
			public:

				/// <summary>
				/// デフォルトデスクの取得
				/// </summary>
				/// <returns></returns>
				static D3D11_RASTERIZER_DESC Desc();

				/// <summary>
				/// デスクの取得
				/// </summary>
				/// <returns></returns>
				static D3D11_RASTERIZER_DESC Desc(D3D11_FILL_MODE fill, D3D11_CULL_MODE cull);

				/// <summary>
				/// ラスタライザステートの作成
				/// </summary>
				/// <param name="desc">デスク情報</param>
				/// <param name="device">デバイスポインタ</param>
				/// <returns></returns>
				HRESULT Create(D3D11_RASTERIZER_DESC desc, ID3D11Device *device) override;
			};
		}
	}
};

#endif
