/*==============================================================================

	Title		: RTV
	Description :
	Date		:
	Author		:

--------------------------------------------------------------------------------

==============================================================================*/



#pragma once
#ifndef _DX11_RTV_H_
#define _DX11_RTV_H_


/*------------------------------------------------------------------------------
* include宣言
------------------------------------------------------------------------------*/
#include <d3d11.h>
#include "dx_dxparts.h"

/*------------------------------------------------------------------------------
* define宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* extern宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* prototype宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* class宣言
------------------------------------------------------------------------------*/
namespace DX {
	namespace DX11 {
		namespace CORE {
			class RTV : public DX::CORE::DX_PARTS<ID3D11RenderTargetView, D3D11_RENDER_TARGET_VIEW_DESC, ID3D11Device> {
			public:

				/// <summary>
				/// デフォルトデスクの取得
				/// </summary>
				/// <returns></returns>
				static D3D11_RENDER_TARGET_VIEW_DESC Desc(DXGI_SWAP_CHAIN_DESC scDesc);

				/// <summary>
				/// RenderTargetViewの作成
				/// </summary>
				/// <param name="swapchain">スワップチェーン</param>
				/// <param name="device">デバイス</param>
				/// <returns></returns>
				HRESULT Create(D3D11_RENDER_TARGET_VIEW_DESC desc, IDXGISwapChain *swapchain, ID3D11Device *device);
			};
		}
	}
}

#endif
