/*==============================================================================

	Title		: SAMPLER
	Description :
	Date		:
	Author		:

--------------------------------------------------------------------------------

==============================================================================*/



#pragma once
#ifndef _DX11_SAMPLER_H_
#define _DX11_SAMPLER_H_


/*------------------------------------------------------------------------------
* include宣言
------------------------------------------------------------------------------*/
#include <d3d11.h>
#include "dx_dxparts.h"

/*------------------------------------------------------------------------------
* define宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* extern宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* prototype宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
* class宣言
------------------------------------------------------------------------------*/
namespace DX {
	namespace DX11 {
		namespace CORE {
			class SAMPLER : public DX::CORE::DX_PARTS<ID3D11SamplerState, D3D11_SAMPLER_DESC, ID3D11Device> {
			public:

				/// <summary>
				/// デフォルトデスクの取得
				/// </summary>
				/// <returns></returns>
				static D3D11_SAMPLER_DESC Desc();

				/// <summary>
				/// デスクの取得
				/// </summary>
				/// <returns></returns>
				static D3D11_SAMPLER_DESC DescLinear();

				/// <summary>
				/// サンプラーステートの作成
				/// </summary>
				/// <param name="desc">デスク情報</param>
				/// <param name="device">デバイスポインタ</param>
				/// <returns></returns>
				HRESULT Create(D3D11_SAMPLER_DESC desc, ID3D11Device *device) override;
			};
		}
	}
};

#endif
